use MyBase

SELECT Фамилия, Имя, Отчество
FROM СТУДЕНТЫ
WHERE ID_Студента IN (
    SELECT ID_Студента
    FROM ОЦЕНКИ
    WHERE Оценка > 3
);

SELECT СТУДЕНТЫ.Фамилия, СТУДЕНТЫ.Имя, СТУДЕНТЫ.Отчество
FROM СТУДЕНТЫ
INNER JOIN ОЦЕНКИ ON СТУДЕНТЫ.ID_Студента = ОЦЕНКИ.ID_Студента
WHERE ОЦЕНКИ.Оценка > 3;

--найти студента с самой высокой оценкой по каждому предмету.
SELECT СТУДЕНТЫ.Фамилия, СТУДЕНТЫ.Имя, СТУДЕНТЫ.Отчество, ПРЕДМЕТ.Название, ОЦЕНКИ.Оценка
FROM СТУДЕНТЫ
INNER JOIN ОЦЕНКИ ON СТУДЕНТЫ.ID_Студента = ОЦЕНКИ.ID_Студента
INNER JOIN ПРЕДМЕТ ON ОЦЕНКИ.ID_Предмета = ПРЕДМЕТ.ID_Предмета
WHERE ОЦЕНКИ.Оценка = (
    SELECT TOP 1 ОЦЕНКИ.Оценка
    FROM ОЦЕНКИ
    WHERE ОЦЕНКИ.ID_Предмета = ПРЕДМЕТ.ID_Предмета
    AND ОЦЕНКИ.ID_Студента = СТУДЕНТЫ.ID_Студента
    ORDER BY ОЦЕНКИ.Оценка DESC
);

--/////
SELECT СТУДЕНТЫ.Фамилия, СТУДЕНТЫ.Имя, СТУДЕНТЫ.Отчество
FROM СТУДЕНТЫ
WHERE NOT EXISTS (
    SELECT 1
    FROM ОЦЕНКИ
    WHERE ОЦЕНКИ.ID_Студента = СТУДЕНТЫ.ID_Студента
    AND ОЦЕНКИ.Оценка < 3
);

--

SELECT СТУДЕНТЫ.Фамилия, СТУДЕНТЫ.Имя,
       (SELECT AVG(ОЦЕНКИ.Оценка) FROM ОЦЕНКИ WHERE ОЦЕНКИ.ID_Студента = СТУДЕНТЫ.ID_Студента AND ОЦЕНКИ.ID_Предмета = 1) AS avg_математика,
       (SELECT AVG(ОЦЕНКИ.Оценка) FROM ОЦЕНКИ WHERE ОЦЕНКИ.ID_Студента = СТУДЕНТЫ.ID_Студента AND ОЦЕНКИ.ID_Предмета = 2) AS avg_физика,
       (SELECT AVG(ОЦЕНКИ.Оценка) FROM ОЦЕНКИ WHERE ОЦЕНКИ.ID_Студента = СТУДЕНТЫ.ID_Студента AND ОЦЕНКИ.ID_Предмета = 3) AS avg_программирование
FROM СТУДЕНТЫ;

--ALL
--студентЫ, чьи все оценки больше или равны 4 по всем предметам

SELECT СТУДЕНТЫ.Фамилия, СТУДЕНТЫ.Имя
FROM СТУДЕНТЫ
WHERE 4 <= ALL (
    SELECT ОЦЕНКИ.Оценка
    FROM ОЦЕНКИ
    WHERE ОЦЕНКИ.ID_Студента = СТУДЕНТЫ.ID_Студента
);

SELECT СТУДЕНТЫ.Фамилия, СТУДЕНТЫ.Имя
FROM СТУДЕНТЫ
WHERE 4 <= ANY (
    SELECT ОЦЕНКИ.Оценка
    FROM ОЦЕНКИ
    WHERE ОЦЕНКИ.ID_Студента = СТУДЕНТЫ.ID_Студента
);

